Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
        ledState_t state;
        state.name = led.name;
        state.state = true;
        vectorState.push_back(state);
    } else {
        Serial.printf_P(PSTR("%s\n"), "Прожектор не доступен для изменения состояния");
        Alarm.disable(led.led.off);
        Alarm.disable(led.led.on);
    }
}

void ledOffHandler(ledDescription& led) {
    if (led.led.enabled) {
        Serial.printf_P(PSTR("Выключение прожектора PIN %d\n"), led.led.pin);
        shiftRegister.setPin(indexRegisterRelay, led.led.pin, LOW);
        sendMessage(led, false);
        Alarm.enable(led.led.off);
        Alarm.enable(led.led.on);

        led.led.currentState = false;

        ledState_t state;
        state.name = led.name;
        state.state = false;
        vectorState.push_back(state);
    } else {
        Serial.printf_P(PSTR("%s\n"), "Прожектор не доступен для изменения состояния");
        Alarm.disable(led.led.off);
        Alarm.disable(led.led.on);
    }
}
void airOnHandler(ledDescription& led) {
    if (led.led.enabled) {
        Serial.printf_P(PSTR("Включение прожектора PIN %d\n"), led.led.pin);
        shiftRegister.setPin(indexRegisterRelay, led.led.pin, HIGH);
        sendMessage(led, true);
        Alarm.enable(led.led.off);
        Alarm.enable(led.led.on);

        led.led.currentState = true;

        ledState_t state;
        state.name = led.name;
        state.state = true;
        vectorState.push_back(state);
    } else {
        Serial.printf_P(PSTR("%s\n"), "Прожектор не доступен для изменения состояния");
        Alarm.disable(led.led.off);
        Alarm.disable(led.led.on);
    }
}

void airOffHandler(ledDescription& led) {
    if (led.led.enabled) {
        Serial.printf_P(PSTR("Выключение прожектора PIN %d\n"), led.led.pin);
        shiftRegister.setPin(indexRegisterRelay, led.led.pin, LOW);
        sendMessage(led, false);
        Alarm.enable(led.led.off);
        Alarm.enable(led.led.on);

        led.led.currentState = false;

        ledState_t state;
        state.name = led.name;
        state.state = false;
        vectorState.push_back(state);
    } else {
        Serial.printf_P(PSTR("%s\n"), "Прожектор не доступен для изменения состояния");
        Alarm.disable(led.led.off);
        Alarm.disable(led.led.on);
    }
}
void printLEDTime(ledPosition position) {
    uint8_t ledsCount(sizeof(leds) / sizeof(*leds));
    uint8_t index;
    bool found = false;
    for (size_t i = 0; i < ledsCount; i++) {
        if (leds[i].position == position) {
            index = i;
            i = ledsCount;
            found = true;
        }
    }
    if (!found) {
        Serial.printf_P(PSTR("%s\n"), "Прожектор не найден!!!");
    } else {
        Serial.printf_P(PSTR(" Вкл-%02d:%02d. Выкл-%02d:%02d. Состояние: %s. Разрешен: %s. PIN: %d\n"), leds[index].led.HOn,
                        leds[index].led.MOn, leds[index].led.HOff, leds[index].led.MOff,
                        ((leds[index].led.currentState == true) ? "включен" : "выключен"),
                        ((leds[index].led.enabled == true) ? "да" : "нет"), leds[index].led.pin

        );
    }
}

void printAllLedsTime() {
    Serial.printf_P(PSTR("%s\n"), "Отображение текущих настроек всех прожекторов");
    for (ledPosition i : ledPositionIterator()) {
        printLEDTime(i);
    }
}
void printDoser(doserType dosertype) {
    uint8_t dosersCount(sizeof(dosers) / sizeof(*dosers));
    uint8_t index;
    bool found = false;
    for (size_t i = 0; i < dosersCount; i++) {
        if (dosers[i].type == dosertype) {
            index = i;
            i = dosersCount;
            found = true;
        }
    }
    if (!found) {
        Serial.printf_P(PSTR("%s\n"), "Дозатор не найден!!!");
    } else {
        Serial.printf_P(
            PSTR("%d => %s: Вкл %02d:%02d. Pins: dir=%d step=%d enable=%d sleep=%d.\nОбъём: %d. Modes:%d.%d.%d Steps:%d\n"),
            dosers[index].index, dosers[index].name.c_str(), dosers[index].hour, dosers[index].minute, dosers[index].dirPin,
            dosers[index].stepPin, dosers[index].enablePin, dosers[index].sleepPin, dosers[index].volume, dosers[index].mode0_pin,
            dosers[index].mode1_pin, dosers[index].mode2_pin, dosers[index].steps);
    }
}

void printAllDosers() {
    Serial.printf_P(PSTR("%s\n"), "Отображение текущих настроек всех прожекторов");
    for (doserType i : doserTypeIterator()) {
        printDoser(i);
    }
}
void setDoser(doserType dosertype) {
    std::unique_ptr<GBasic> doser{};
    uint8_t dosersCount = (sizeof(dosers) / sizeof(*dosers));
    String name;
    uint8_t i = 0;
    bool found = false;
    for (size_t k = 0; k < dosersCount; k++) {
        if (dosers[k].type == dosertype) {
            name = dosers[k].name;
            i = k;
            found = true;
            k = dosersCount;
        }
    }
    if (!found) {
        Serial.printf_P(PSTR("%s %s %s\n"), "Дозатор", name.c_str(), "не найден");
    } else {
        if (!Firebase.getString(data, pathDoser + name)) {
            Serial.printf_P(PSTR("%s %s: %s\n"), "Ошибка загрузки параметров дозатора", name.c_str(), data.errorReason().c_str());
        } else {
            if ((data.dataType() == "string")) {
                String payload = data.stringData();
                //"d=1#s=1#e=2#sl=2#ss=200#0=1#1=2#2=4#i=3#t=23:59"
                std::vector<String> vectorPayload = splitVector(payload, '#');

                for (String pair : vectorPayload) {
                    std::vector<String> pairItem = splitVector(pair, '=');
                    if (pairItem[0] == "d") {
                        dosers[i].dirPin = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "s") {
                        dosers[i].stepPin = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "e") {
                        dosers[i].enablePin = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "sl") {
                        dosers[i].sleepPin = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "ss") {
                        dosers[i].steps = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "0") {
                        dosers[i].mode0_pin = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "1") {
                        dosers[i].mode1_pin = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "2") {
                        dosers[i].mode2_pin = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "i") {
                        dosers[i].index = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "t") {
                        std::vector<String> timeVector = splitVector(pairItem[1], ':');
                        dosers[i].hour = timeVector[0].toInt();
                        dosers[i].minute = timeVector[1].toInt();
                        timeVector.clear();
                    }
                    pairItem.clear();
                }
                vectorPayload.clear();
                doser = std::make_unique<GBasic>(dosers[i].steps, dosers[i].dirPin, dosers[i].stepPin, dosers[i].enablePin,
                                                 dosers[i].mode0_pin, dosers[i].mode1_pin, dosers[i].mode2_pin, shiftRegister,
                                                 dosers[i].index);
                switch (dosertype) {
                    case K:
                        doserK = std::move(doser);
                        break;
                    case NP:
                        doserNP = std::move(doser);
                        break;
                    case Fe:
                        doserFe = std::move(doser);
                        break;
                    default:
                        Serial.printf_P(PSTR("%s %s"), "Неизвестный тип дозатора", ToString(dosertype));
                        break;
                }
                dosers[i].alarm = Alarm.alarmRepeat(dosers[i].hour, dosers[i].minute, 0, doserHandler, dosers[i]);
            } else {
                Serial.printf_P(PSTR("%s\n"), "Ответ не String");
            }
        }
    }
}
//Загрузка времени включения/выключения прожектора
void setLEDTime(ledPosition position) {
    uint8_t ledsCount = (sizeof(leds) / sizeof(*leds));
    String ledPath;
    uint8_t i;
    bool found = false;
    for (size_t k = 0; k < ledsCount; k++) {
        if (leds[k].position == position) {
            ledPath = leds[k].name;
            i = k;
            found = true;
            k = ledsCount;
        }
    }
    if (found) {
        if (Firebase.getJSON(data, pathLight + ledPath)) {
            if ((data.dataType() == "json")) {
                String json = data.jsonString();
                StaticJsonDocument<180> doc;
                std::vector<String> vectorString;
                DeserializationError err = deserializeJson(doc, json);
                if (err) {
                    Serial.printf_P(PSTR("Ошибка десериализации: %s\n"), err.c_str());
                } else {
                    leds[i].led.enabled = doc["enabled"];
                    leds[i].led.pin = doc["pin"];
                    leds[i].led.currentState = doc["state"];

