Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
                    vectorString.clear();
                    vectorString = splitVector(doc["off"], ':');
                    leds[i].led.HOff = vectorString[0].toInt();
                    leds[i].led.MOff = vectorString[1].toInt();

                    vectorString.clear();
                    vectorString = splitVector(doc["on"], ':');
                    leds[i].led.HOn = vectorString[0].toInt();
                    leds[i].led.MOn = vectorString[1].toInt();

                    leds[i].led.off = Alarm.alarmRepeat(leds[i].led.HOff, leds[i].led.MOff, 0, ledOffHandler, leds[i]);
                    leds[i].led.on = Alarm.alarmRepeat(leds[i].led.HOn, leds[i].led.MOn, 0, ledOnHandler, leds[i]);

                    uint8_t minutes = clockRTC.getDateTime().hour * 60 + clockRTC.getDateTime().minute;
                    uint8_t minutesOn = leds[i].led.HOn * 60 + leds[i].led.MOn;
                    uint8_t minutesOff = leds[i].led.HOff * 60 + leds[i].led.MOff;
                    if ((minutes > minutesOn) && (minutes < minutesOff)) {
                        ledOnHandler(leds[i]);
                    } else {
                        ledOffHandler(leds[i]);
                    }
                    doc.clear();
                }
            } else {
                Serial.printf_P(PSTR("%s\n"), "Ответ не является JSON объектом");
            }
        } else {
            Serial.printf_P(PSTR("%s: %s\n"), "Ошибка загрузки параметров прожектора", data.errorReason().c_str());
        }
    } else {
        Serial.printf_P(PSTR("%s\n"), "Прожектор не найден");
    }
}
uint16_t doserAddress(const uint8_t num) {
    uint8_t ledsCount(sizeof(leds) / sizeof(*leds));
    return StartAddress + num * sizeof(doser) + ledsCount * sizeof(ledDescription) + 1;
}
void writeEEPROMDoser() {
    uint8_t dosersCount(sizeof(dosers) / sizeof(*dosers));
    for (size_t i = 0; i < dosersCount; i++) {
        if (eeprom.eeprom_write(doserAddress(i), dosers[i])) {
            Serial.printf_P(PSTR(" Параметры по дозатору %s сохранены в EEPROM\n"), dosers[i].name.c_str());
        } else {
            Serial.printf_P(PSTR(" Ошибка сохранения параметров дозатора %s в EEPROM\n"), dosers[i].name.c_str());
        }
    }
}
uint16_t ledAddress(const uint8_t num) {
    return StartAddress + num * sizeof(ledDescription);
}
void writeEEPROMLed() {
    uint8_t ledsCount(sizeof(leds) / sizeof(*leds));
    for (size_t i = 0; i < ledsCount; i++) {
        if (eeprom.eeprom_write(ledAddress(i), leds[i])) {
            Serial.printf_P(PSTR(" Параметры по прожектору %s сохранены в EEPROM\n"), leds[i].name.c_str());
        } else {
            Serial.printf_P(PSTR(" Ошибка сохранения параметров прожектора %s в EEPROM\n"), leds[i].name.c_str());
        }
    }
}
void readOptionsEEPROM() {
    ledDescription_t ledFromEEPROM;
    doser doserFromEEPROM;
    Serial.printf_P(PSTR("%s\n"), "Загрузка настроек из EEPROM");
    uint8_t ledsCount(sizeof(leds) / sizeof(*leds));
    uint8_t dosersCount(sizeof(dosers) / sizeof(*dosers));
    for (size_t i = 0; i < ledsCount; i++) {
        eeprom.eeprom_read(ledAddress(i), &ledFromEEPROM);
        leds[i] = ledFromEEPROM;
        leds[i].led.off = Alarm.alarmRepeat(leds[i].led.HOff, leds[i].led.MOff, 0, ledOffHandler, leds[i]);
        leds[i].led.on = Alarm.alarmRepeat(leds[i].led.HOn, leds[i].led.MOn, 0, ledOnHandler, leds[i]);

        uint8_t minutes = clockRTC.getDateTime().hour * 60 + clockRTC.getDateTime().minute;
        uint8_t minutesOn = leds[i].led.HOn * 60 + leds[i].led.MOn;
        uint8_t minutesOff = leds[i].led.HOff * 60 + leds[i].led.MOff;
        if ((minutes > minutesOn) && (minutes < minutesOff)) {
            ledOnHandler(leds[i]);
        } else {
            ledOffHandler(leds[i]);
        }
    }
    for (size_t i = 0; i < dosersCount; i++) {
        eeprom.eeprom_read(doserAddress(i), &doserFromEEPROM);
        dosers[i] = doserFromEEPROM;
        dosers[i].alarm = Alarm.alarmRepeat(dosers[i].hour, dosers[i].minute, 0, doserHandler, dosers[i]);
    }
    printAllLedsTime();
    printAllDosers();
}
void setAir(){
     if (!Firebase.getString(data,pathAir)) {
            Serial.printf_P(PSTR("%s: %s\n"), "Ошибка загрузки параметров аэратора", data.errorReason().c_str());
        } else {
            if ((data.dataType() == "string")) {
                String payload = data.stringData();
                //"on=13:22#off=23:54#e=1#s=1#p=12"
                std::vector<String> vectorPayload = splitVector(payload, '#');
                std::vector<String> timeVector;
                for (String pair : vectorPayload) {
                    std::vector<String> pairItem = splitVector(pair, '=');
                    if (pairItem[0] == "on") {
                       timeVector= splitVector(pairItem[1], ':');
                       air.HOn = timeVector[0].toInt();
                        air.MOn = timeVector[1].toInt();
                        timeVector.clear();
                    }
                    if (pairItem[0] == "off") {
                        timeVector= splitVector(pairItem[1], ':');
                       air.HOff = timeVector[0].toInt();
                        air.MOff = timeVector[1].toInt();
                        timeVector.clear();
                    }
                    if (pairItem[0] == "e") {
                        air.enabled = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "s") {
                        air.currentState = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "p") {
                        air.pin = pairItem[1].toInt();
                    }
                    pairItem.clear();
                }
                vectorPayload.clear();
                
                air.on = Alarm.alarmRepeat(air.HOn, air.MOn, 0, airOnHandler, air);
                air.off = Alarm.alarmRepeat(air.HOff, air.MOff, 0, airOffHandler, air);
            } else {
                Serial.printf_P(PSTR("%s\n"), "Ответ не String");
            }
        }
}
void readOptionsFirebase() {
    Serial.printf_P(PSTR("%s\n"), "Загрузка из Firebase");

    Serial.printf_P(PSTR("%s\n"), "Прожекторы...");
    for (ledPosition i : ledPositionIterator()) {
        setLEDTime(i);
    }

    Serial.printf_P(PSTR("%s\n"), "Дозаторы...");
    for (doserType i : doserTypeIterator()) {
        setDoser(i);
    }

    Serial.printf_P(PSTR("%s\n"), "Запись в EEPROM");
    writeEEPROMLed();
    writeEEPROMDoser();
}
double floatToDouble(float x) {
    return static_cast<double>(x);
}
//Сохранение показаний датчиков температуры
void writeTemperatureFirebase() {
    if (!WiFi.isConnected())
        return;

    char* p1 = clockRTC.dateFormat("Y-m-d", clockRTC.getDateTime());
    String deviceDateKey = p1;
    free(p1);

    FirebaseJson jsonOnline, jsonHistory;
    char* p2 = clockRTC.dateFormat("H:i:s d.m.Y", clockRTC.getDateTime());
    jsonOnline.add("DateTime", String(p2));
    jsonOnline.add("temp1", floatToDouble(temp1));
    jsonOnline.add("temp2", floatToDouble(temp2));
    free(p2);
    char* p3 = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    jsonHistory.add("DateTime", String(p3));
    jsonHistory.add("temp1", floatToDouble(temp1));
    jsonHistory.add("temp2", floatToDouble(temp2));
    free(p3);
    Serial.printf_P(PSTR("%s"), "Отправляем температуру в ветку Online -> ");
    if (Firebase.setJSON(data, pathTemperatureOnline, jsonOnline)) {
        Serial.printf_P(PSTR("%s\n"), "OK");
    } else {
        Serial.printf_P(PSTR("Ошибка: %s\n"), data.errorReason().c_str());
    }
    jsonOnline.clear();

